import { type ParsedCell, parseTableRows, genGeneratorArgs, genGeneratorSignatures } from "./shared";

function groupByEdge(tableRowsParsed: ParsedCell[][]): ParsedCell[][][] {
  const groupedTests = [];
  let curTest = [];
  for (const row of tableRowsParsed) {
    if (curTest.length === 3) {
      groupedTests.push(curTest);
      curTest = [];
    }
    curTest.push(row);
  }
  return groupedTests;
}

const phaseCodeMapping = {
  // set-off point
  setup: (argsString: string) => `gen_edge_setup({${argsString}})`,
  "v-A": (argsString: string) => `gen_edge_setup({${argsString}})`,
  // transition
  transition: (argsString: string) => `gen_transition({${argsString}})`,
  edge: (argsString: string) => `gen_transition({${argsString}})`,
  // destination
  elements: (argsString: string) => `gen_ui_spec({${argsString}})`,
  "v-B": (argsString: string) => `gen_ui_spec({${argsString}})`,
}

function stringifyTestRows(testPhaseRows: ParsedCell[][], ind: number, groupedColumns: Record<string, Set<string>> = {}): string {
  const testParameterDeclaration = {
    setup: null,
    "v-A": null,
    transition: null,
    edge: null,
    elements: null,
    "v-B": null,
  };

  for (const phaseRow of testPhaseRows) {
    const [phaseCell, ...argCells] = phaseRow;

    if (!(phaseCell.value in phaseCodeMapping)) {
      // console.warn(`Unrecognized phase "${phaseCell}"`);
      continue;
    }

    const customGrouping = phaseCell.value in groupedColumns && groupedColumns[phaseCell.value].size > 0;


    const filteredCells = customGrouping
      ? argCells.filter((cell) => cell.value !== "" && groupedColumns[phaseCell.value].has(cell.key))
      : argCells.filter((cell) => cell.value !== "");

    console.log("filteredCells:", filteredCells);

    console.log(phaseCell.value);
    // @ts-ignore
    testParameterDeclaration[phaseCell.value] = phaseCodeMapping[phaseCell.value](genGeneratorArgs(filteredCells));
  }

  return `{
  title: "#${ind + 1}",
  setup: ${testParameterDeclaration.setup ?? testParameterDeclaration["v-A"]},
  transition: ${testParameterDeclaration.transition ?? testParameterDeclaration.edge},
  elements: ${testParameterDeclaration.elements ?? testParameterDeclaration["v-B"]}
}`;
}

// TODO: добавить переключатель для рендеринга transition в виде вызова единой функции и в виде списка дефолтных функций (input, select, click, toggle)
// TODO: приделать разбиение колонок на setup/transition/ui по объединяющему хедеру
// TODO: приделать поддержку вложенности внутри каждой группы колонок, чтобы аргументы генераторов тоже были объектами с вложенностями
// TODO: научиться работать с таблицами, которые разбивают ячейки знаками "+"

// TODO: приделать интерполяцию, которая активируется только в том случае, если в каком-то из столбцов указано множественное название (типа схлопнутая краткая запись, чтобы не повторять один и тот же набор тестов для разных вариаций одного из аргументов)
// TODO: поддерживать subset-ы для колонок, чтобы указывать явно какие столцбы в какой генератор пробрасываются в качестве аргументов
// TODO: написать режим работы с typescript (вместо js-doc надо формировать определения типов)
// TODO: обработать случай, когда в генератор не падает ни одного аргумента (надо передавать строку "{}" без переносов)
// TODO: научиться обрабатывать массивы и объекты в качестве значений аргументов в ячейках
// TODO: использовать всё, что находится на 0й строчке перехода за таблицей в качестве заголовка теста
// TODO: генерить компонент с пропами по выбранным столбцам из таблицы
// TODO: приделать обработку дефолтных значений из строчки shared
// TODO: приделать определение типов аргументов

const returnTypesCode = {
  gen_edge_setup: "ComponentSetup",
  gen_transition: "FSMTransition",
  gen_ui_spec: "FSMElement[]"
}

const generatorBoilerplate = {
  gen_edge_setup: "",
  gen_transition: "return (wr) => {\n // transition implementation\n};",
  gen_ui_spec: `const normalized_config = {
  ...base_ui_config,
  ...config,
};
/** @type {FSMElement[]} */
const ui_spec = [];
// ui_spec generation
return ui_spec;
`
}
export function genEdgeSuite(markdownTable: string, groupedColumns: Record<string, Set<string>>): [string, string[]] {

  const [tableRowsParsed, headers] = parseTableRows(markdownTable);
  const tableRowsGroupedByEdge = groupByEdge(tableRowsParsed);

  const generatedTests = tableRowsGroupedByEdge.map(((testRows, ind) => stringifyTestRows(testRows, ind, groupedColumns)));

  const generator_signatures = genGeneratorSignatures<keyof typeof returnTypesCode>(
    ["gen_edge_setup", "gen_transition", "gen_ui_spec"],
    headers,
    returnTypesCode,
    generatorBoilerplate,
  );
  return [`${generator_signatures}\n\nconst testSuite = [\n${generatedTests.join(",\n")}\n];`.replaceAll("\t", "  "), headers];
}

// TODO подуматт: как автоматизировать генерацию внутренностей генераторов?
// -- для этого нужна некоторая точка входа, некоторый единый объект для кастомизации в каждом генераторе
// -- чтобы можно было в качестве аргументов генератора пробрасывать пути до значений внутри этого объекта и сами значения
// -- можно описать несколько фикстур из БД, и скриптом сгенерить из них вариации, которые учитывают все поля, указанные в разных объектах массива
//    -- для этого нужно типизировать фикстуру, чтобы скрипт хорошо работал
//    -- а еще типы можно использовать чтобы генерить значения автоматически, типа написал строка, генерятся тесты с рандомными строками в этом поле, написал тип более точно (юнион строк), сгенерились тесты с юнионом строк
// TODO подуматт: использовать вместо md-таблиц что-то более удобное? импортировать редактор таблиц типа excel?

const a = `
+====+============+=======+============+=========+=====+=====+=======+=======================+====+=====+==============+=======+=======+====+=========+========+===========+==========+
| MODEL DATA                            =====                                                                                               | VIEW DATA                               |
+----+------------+-------+------------+=====----+-----+-----+-------+-----------------------+----+-----+--------------+-------+------------+---------+--------+-----------+----------+
|                 |                    |         | compound_substances                       | QCs                                          |                                         |
+ substance       + qc_type            + protocol+-----+-----+-------+-----------------------+----+-----+--------------+-------+------------+           Buttons visibility            +
|                 |                    |         |     | composition_spec                    | operation               | qc_records                    |                                         |
+----+------------+-------+------------+--------+ sid +-----+-------+------------------------+----+-----+--------------+-------+------------+---------+--------+-----------+----------+
| id | name       | key   | title      | otk    |     | pid | qctk  | reference              | id | pid | completed_at | qctk  | m_v        | Approve | Reject | Unapprove | Unreject |
+====+============+=======+============+========+=====+=====+=======+========================+====+=====+================+=====+=======+====+=========+========+===========+==========+
| 6.3.1. each analytical data field has a measured value                                                                                                                                   |
+----+------------+-------+------------+--------+-----+-----+-------+------------------------+----+-----+--------------+-------+------------+---------+--------+-----------+----------+
|    |            | qctk0 | appearance |        | 0   | 0   | qctk0 | exact: "blue liquid"   | 18 | 0   | {{TIME18}}   | qctk0 | red liquid | 0       | 1      | 1         | 0        |
| 10 | {{NAME10}} | qctk1 | mol%       | {{T1}} | 10  | 1   | qctk1 | min: 95                | 19 | 1   | {{TIME19}}   | qctk1 | 96         |         |        |           |          |
|    |            | qctk2 | OD% (260)  | {{T2}} |     |     |       |                        | 20 | 2   | {{TIME20}}   | qctk2 | 97         |         |        |           |          |
|    |            | qctk3 | mM         |        |     |     |       |                        | 21 | 0   | {{TIME21}}   | qctk3 | 10         |         |        |           |          |
+====+============+=======+============+========+=====+=====+=======+========================+====+=====+================+=====+=======+====+=========+========+===========+==========+
6.3.2. one analytical data field does not have a measured value                                                                                                                          |
+----+------------+-------+------------+--------+-----+-----+-------+------------------------+----+-----+--------------+-------+------------+---------+--------+-----------+----------+
|    |            | qctk0 | appearance |        | 0   | 0   | qctk0 | exact: "blue liquid"   |    |     |              |       |            | 0       | 1      | 1         | 0        |
| 10 | {{NAME10}} | qctk1 | mol%       | {{T1}} | 10  | 1   | qctk1 | min: 95                | 19 | 1   | {{TIME19}}   | qctk1 | 96         |         |        |           |          |
|    |            | qctk2 | OD% (260)  | {{T2}} |     |     |       |                        | 20 | 2   | {{TIME20}}   | qctk2 | 97         |         |        |           |          |
|    |            | qctk3 | mM         |        |     |     |       |                        | 21 | 0   | {{TIME21}}   | qctk3 | 10         |         |        |           |          |
+====+============+=======+============+========+=====+=====+=======+========================+====+=====+================+=====+=======+====+=========+========+===========+==========+
6.3.3. only one analytical data field has a measured value                                                                                                                               |
+----+------------+-------+------------+--------+-----+-----+-------+------------------------+----+-----+--------------+-------+------------+---------+--------+-----------+----------+
|    |            | qctk0 | appearance |        | 0   | 0   | qctk0 | exact: "blue liquid"   | 18 | 0   | {{TIME18}}   | qctk0 | red liquid | 0       | 1      | 1         | 0        |
| 10 | {{NAME10}} | qctk1 | mol%       | {{T1}} | 10  | 1   | qctk1 | min: 95                |    |     |              |       |            |         |        |           |          |
+====+============+=======+============+========+=====+=====+=======+========================+====+=====+================+=====+=======+====+=========+========+===========+==========+
6.3.4. none of the analytical data fields have a measured value                                                                                                                          |
+----+------------+-------+------------+--------+-----+-----+-------+------------------------+----+-----+--------------+-------+------------+---------+--------+-----------+----------+
|    |            | qctk0 | appearance |        | 0   | 0   | qctk0 | exact: "blue liquid"   |    |     |              |       |            | 0       | 0      | 1         | 0        |
| 10 | {{NAME10}} | qctk1 | mol%       | {{T1}} | 10  | 1   | qctk1 | min: 95                |    |     |              |       |            |         |        |           |          |
+====+============+=======+============+========+=====+=====+=======+========================+====+=====+==============+=======+============+=========+========+===========+==========+
`;

const b = `
+====+============+=======+============+====+========+=====+=====+=======+========================+====+=====+==============+============+=====+=======+====+=========+========+===========+==========+
| MODEL DATA                                                                                                                                                | VIEW DATA                               |
+----+------------+-------+------------+----+--------+-----+-----+-------+------------------------+----+-----+--------------+----+-----+-------+------------+---------+--------+-----------+----------+
|                 |                    |             | compound_substances                        | QCs                                                     |                                         |
+ substance       + qc_type            + protocol    +-----+-----+-------+------------------------+----+-----+--------------+----+-----+-------+------------+           Buttons visibility            +
|                 |                    |             |     | composition_spec                     | operation               | qc_records                    |                                         |
+----+------------+-------+------------+----+--------+ sid +-----+-------+------------------------+----+-----+--------------+----+-----+-------+------------+---------+--------+-----------+----------+
| id | name       | key   | title      | id | otk    |     | pid | qctk  | reference              | id | pid | completed_at | id | sid | qctk  | m_v        | Approve | Reject | Unapprove | Unreject |
+====+============+=======+============+====+========+=====+=====+=======+========================+====+=====+==============+====+=====+=======+============+=========+========+===========+==========+
| 6.2.1. each analytical data field has a measured value                                                                                                                                              |
+----+------------+-------+------------+----+--------+-----+-----+-------+------------------------+----+-----+--------------+----+-----+-------+------------+---------+--------+-----------+----------+
|    |            | qctk0 | appearance |    |        | 0   | 0   | qctk0 | exact: "blue liquid"   | 18 | 0   | {{TIME18}}   | 18 | 0   | qctk0 | red liquid | 1       | 0      | 0         | 1        |
| 10 | {{NAME10}} | qctk1 | mol%       | 1  | {{T1}} | 10  | 1   | qctk1 | min: 95                | 19 | 1   | {{TIME19}}   | 19 | 10  | qctk1 | 96         |         |        |           |          |
|    |            | qctk2 | OD% (260)  | 2  | {{T2}} |     |     |       |                        | 20 | 2   | {{TIME20}}   | 20 | 10  | qctk2 | 97         |         |        |           |          |
|    |            | qctk3 | mM         |    |        |     |     |       |                        | 21 | 0   | {{TIME21}}   | 21 | 10  | qctk3 | 10         |         |        |           |          |
+====+============+=======+============+====+========+=====+=====+=======+========================+====+=====+==============+====+=====+=======+============+=========+========+===========+==========+
| 6.2.2. one analytical data field does not have a measured value                                                                                                                                     |
+----+------------+-------+------------+----+--------+-----+-----+-------+------------------------+----+-----+--------------+----+-----+-------+------------+---------+--------+-----------+----------+
|    |            | qctk0 | appearance |    |        | 0   | 0   | qctk0 | exact: "blue liquid"   |    |     |              |    |     |       |            | 0       | 0      | 0         | 1        |
| 10 | {{NAME10}} | qctk1 | mol%       | 1  | {{T1}} | 10  | 1   | qctk1 | min: 95                | 19 | 1   | {{TIME19}}   | 19 | 10  | qctk1 | 96         |         |        |           |          |
|    |            | qctk2 | OD% (260)  | 2  | {{T2}} |     |     |       |                        | 20 | 2   | {{TIME20}}   | 20 | 10  | qctk2 | 97         |         |        |           |          |
|    |            | qctk3 | mM         |    |        |     |     |       |                        | 21 | 0   | {{TIME21}}   | 21 | 10  | qctk3 | 10         |         |        |           |          |
+====+============+=======+============+====+========+=====+=====+=======+========================+====+=====+==============+====+=====+=======+============+=========+========+===========+==========+
| 6.2.3. only one analytical data field has a measured value                                                                                                                                          |
+----+------------+-------+------------+----+--------+-----+-----+-------+------------------------+----+-----+--------------+----+-----+-------+------------+---------+--------+-----------+----------+
|    |            | qctk0 | appearance |    |        | 0   | 0   | qctk0 | exact: "blue liquid"   | 18 | 0   | {{TIME18}}   | 18 | 0   | qctk0 | red liquid | 0       | 0      | 0         | 1        |
| 10 | {{NAME10}} | qctk1 | mol%       | 1  | {{T1}} | 10  | 1   | qctk1 | min: 95                |    |     |              |    |     |       |            |         |        |           |          |
+====+============+=======+============+====+========+=====+=====+=======+========================+====+=====+==============+====+=====+=======+============+=========+========+===========+==========+
| 6.2.4. none of the analytical data fields have a measured value                                                                                                                                     |
+----+------------+-------+------------+----+--------+-----+-----+-------+------------------------+----+-----+--------------+----+-----+-------+------------+---------+--------+-----------+----------+
|    |            | qctk0 | appearance |    |        | 0   | 0   | qctk0 | exact: "blue liquid"   |    |     |              |    |     |       |            | 0       | 0      | 0         | 1        |
| 10 | {{NAME10}} | qctk1 | mol%       | 1  | {{T1}} | 10  | 1   | qctk1 | min: 95                |    |     |              |    |     |       |            |         |        |           |          |
+====+============+=======+============+====+========+=====+=====+=======+========================+====+=====+==============+====+=====+=======+============+=========+========+===========+==========+
`;


const c = `
+====+============+=======+============+====+========+=====+=====+=======+========================+====+=====+==============+============+=====+=======+====+=========+========+===========+==========+
| MODEL DATA                                                                                                                                                | VIEW DATA                               |
+----+------------+-------+------------+----+--------+-----+-----+-------+------------------------+----+-----+--------------+----+-----+-------+------------+---------+--------+-----------+----------+
|                 |                    |             | compound_substances                        | QCs                                                     |                                         |
+ substance       + qc_type            + protocol    +-----+-----+-------+------------------------+----+-----+--------------+----+-----+-------+------------+           Buttons visibility            +
|                 |                    |             |     | composition_spec                     | operation               | qc_records                    |                                         |
+----+------------+-------+------------+----+--------+ sid +-----+-------+------------------------+----+-----+--------------+----+-----+-------+------------+---------+--------+-----------+----------+
| id | name       | key   | title      | id | otk    |     | pid | qctk  | reference              | id | pid | completed_at | id | sid | qctk  | m_v        | Approve | Reject | Unapprove | Unreject |
+====+============+=======+============+====+========+=====+=====+=======+========================+====+=====+==============+====+=====+=======+============+=========+========+===========+==========+
| 6.1.1. each analytical data field has a measured value                                                                                                                                              |
+----+------------+-------+------------+----+--------+-----+-----+-------+------------------------+----+-----+--------------+----+-----+-------+------------+---------+--------+-----------+----------+
|    |            | qctk0 | appearance |    |        | 0   | 0   | qctk0 | exact: "blue liquid"   | 18 | 0   | {{TIME18}}   | 18 | 0   | qctk0 | red liquid | 1       | 1      | 0         | 0        |
| 10 | {{NAME10}} | qctk1 | mol%       | 1  | {{T1}} | 10  | 1   | qctk1 | min: 95                | 19 | 1   | {{TIME19}}   | 19 | 10  | qctk1 | 96         |         |        |           |          |
|    |            | qctk2 | OD% (260)  | 2  | {{T2}} |     |     |       |                        | 20 | 2   | {{TIME20}}   | 20 | 10  | qctk2 | 97         |         |        |           |          |
|    |            | qctk3 | mM         |    |        |     |     |       |                        | 21 | 0   | {{TIME21}}   | 21 | 10  | qctk3 | 10         |         |        |           |          |
+====+============+=======+============+====+========+=====+=====+=======+========================+====+=====+==============+====+=====+=======+============+=========+========+===========+==========+
| 6.1.2. one analytical data field does not have a measured value                                                                                                                                     |
+----+------------+-------+------------+----+--------+-----+-----+-------+------------------------+----+-----+--------------+----+-----+-------+------------+---------+--------+-----------+----------+
|    |            | qctk0 | appearance |    |        | 0   | 0   | qctk0 | exact: "blue liquid"   |    |     |              |    |     |       |            | 0       | 1      | 0         | 0        |
| 10 | {{NAME10}} | qctk1 | mol%       | 1  | {{T1}} | 10  | 1   | qctk1 | min: 95                | 19 | 1   | {{TIME19}}   | 19 | 10  | qctk1 | 96         |         |        |           |          |
|    |            | qctk2 | OD% (260)  | 2  | {{T2}} |     |     |       |                        | 20 | 2   | {{TIME20}}   | 20 | 10  | qctk2 | 97         |         |        |           |          |
|    |            | qctk3 | mM         |    |        |     |     |       |                        | 21 | 0   | {{TIME21}}   | 21 | 10  | qctk3 | 10         |         |        |           |          |
+====+============+=======+============+====+========+=====+=====+=======+========================+====+=====+==============+====+=====+=======+============+=========+========+===========+==========+
| 6.1.3. only one analytical data field has a measured value                                                                                                                                          |
+----+------------+-------+------------+----+--------+-----+-----+-------+------------------------+----+-----+--------------+----+-----+-------+------------+---------+--------+-----------+----------+
|    |            | qctk0 | appearance |    |        | 0   | 0   | qctk0 | exact: "blue liquid"   | 18 | 0   | {{TIME18}}   | 18 | 0   | qctk0 | red liquid | 0       | 1      | 0         | 0        |
| 10 | {{NAME10}} | qctk1 | mol%       | 1  | {{T1}} | 10  | 1   | qctk1 | min: 95                |    |     |              |    |     |       |            |         |        |           |          |
+====+============+=======+============+====+========+=====+=====+=======+========================+====+=====+==============+====+=====+=======+============+=========+========+===========+==========+
| 6.1.4. none of the analytical data fields have a measured value                                                                                                                                     |
+----+------------+-------+------------+----+--------+-----+-----+-------+------------------------+----+-----+--------------+----+-----+-------+------------+---------+--------+-----------+----------+
|    |            | qctk0 | appearance |    |        | 0   | 0   | qctk0 | exact: "blue liquid"   |    |     |              |    |     |       |            | 0       | 0      | 0         | 0        |
| 10 | {{NAME10}} | qctk1 | mol%       | 1  | {{T1}} | 10  | 1   | qctk1 | min: 95                |    |     |              |    |     |       |            |         |        |           |          |
+====+============+=======+============+====+========+=====+=====+=======+========================+====+=====+==============+====+=====+=======+============+=========+========+===========+==========
`



/**
- substance -> (sample.compound.cso.substance)
- substance -> (sample.qc.substance) - нет референса или у сабстанса нет спеки
- property -> keys(sample.compound.cso.comp_spec.reference)
- reference -> values(sample.compound.cso.comp_spec.reference[i])
- actual value -> sample.sample_state
- historical values -> sample.sample_state

|                                                           setup                                                     |                       UI                          |
|----------------------------------|----------------------------------|-----------------------|-----------------------|---------------------------------------------------|
|           comp_spec1             |              comp_spec2          |           qc1         |           qc2         |           |            |            |      |      |
|----------------------------------|----------------------------------|-----------------------|-----------------------|           |            |            |      |      |
| prot  | substance  | d_type      | prot  | substance  | d_type      | qc_rec1    | qc_rec2  | qc_rec1    | qc_rec2  | substance | ref1       | ref2       | val1 | val2 |
| ----- | ---------- | ----------- | ----- | ---------- | ----------- | ---------- | -------- | ---------- | -------- | --------- | ---------- | ---------- | ---- | ---- |
| null  | DMSO (1)   | null        | null  | null       | null        | null       | null     | null       | null     | DMSO      | -          | -          | -    | -    |
|       |            | appearance  |       |            |             |            |          |            |          |           | red liquid |            |      |      |
|       |            | mol%: >=90  |       |            |             |            |          |            |          |           | mol%: >=90 |            |      |      |
|       |            | mol%: >=90  |       |            |             |            |          |            |          |           | mol%: >=90 |            |      |      |
|       |            | mol%: >=90  |       |            |             | 91%        |          |            |          |           | mol%: >=90 |            | 91%  |      |

|       |            | mol%: >=90  |       | DMSO (1)   |             | 91%        |          |            |          |           | mol%: >=90 |            | 91%  |      |
| 1     |            | mol%: >=90  | 1     |            | mol%: >=90  |            |          |            |          |           | mol%: >=90 | mol%: >=90 |      |      |
| 1     |            | mol%: >=90  | 1     |            | mol%: >=90  |            |          |            |          |           | mol%: >=90 | mol%: >=90 |      |      |
| 1     |            | mol%: >=90  | 1     |            | mol%: >=90  | 91%        |          |            |          |           | mol%: >=90 | mol%: >=90 | 91%  |      |
| 1     |            | mol%: >=90  | 1     |            | mol%: >=90  | 91%        | 89%      |            |          |           | mol%: >=90 | mol%: >=90 | 91%  | 89%  |
| 1     |            | mol%: >=90  | 1     |            | mol%: >=90  | 91%        |          |            |          |           | mol%: >=90 | mol%: >=90 | 91%  |      |


В отдельной таблице разбираем historical values, за setup возьмем два protocol-а (второй опциональный)

 */